[
  {
    "name": "Heritage Architectural Walk (West)",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "Shimla’s Heritage Zone on foot — colonial architecture, viewpoints, and a slow finish at Vice Regal Lodge.",
    "type": "Heritage walk",
    "duration": "2 hrs",
    "effort": "Gentle",
    "whyWeChoseThis": "It packs Shimla’s strongest colonial-era architecture into a single walk and works best for travellers who enjoy history, design, and observation.",
    "goldenWay": "At Vice Regal Lodge, head toward the tennis court side and sit near the jungle edge. Sketch or journal and notice small design details (light, glass, water systems) rather than rushing through.",
    "images": [
      "carousel_images/SML001_XT059617.JPG",
      "carousel_images/SML001_XT059608.JPG",
      "carousel_images/SML001_XT059611.JPG",
      "carousel_images/SML001_XT059614.JPG",
      "carousel_images/SML001_XT059615.JPG"
    ],
    "about": [
      "A slow heritage walk within Shimla’s official Heritage Zone, built around architecture, civic spaces, and mountain-town street life.",
      "The natural finish is Vice Regal Lodge — best treated as a pause point, not a rushed stop."
    ],
    "whatYouGet": [
      "Victorian & post-Victorian architecture",
      "Iconic buildings en route: Christ Church, Gaiety Theatre, the old Bandstand, plus heritage-era hotels, early banks, and former government offices",
      "Viewpoints with southern-hills + occasional northern-mountain glimpses",
      "Pedestrian-friendly walking with minimal vehicle movement",
      "Vice Regal Lodge as a calm end-point (museum + optional guided tour)"
    ],
    "breakdown": {
      "how_it_feels": "Observational and unhurried — the reward is noticing architecture and how these heritage spaces are used today.",
      "what_to_expect": [
        "Heritage buildings and architectural variety",
        "Photo opportunities + open views",
        "A mostly pedestrian, low-traffic experience"
      ],
      "effort_and_surface": [
        "Distance: 3.7 km",
        "Trail grade: 2 (Gentle)",
        "Surface: smooth paved walking",
        "Min walking time ~1 hr 20 min; best enjoyed as ~2 hrs with pauses"
      ],
      "time_and_access": [
        "Best done before noon",
        "Wheelchair accessible; wheelchairs available on rent from Mall Road (as per sheet)",
        "Soft/managed exit points exist if you want to shorten the walk (as marked on maps)"
      ],
      "vice_regal_lodge_practicalities": [
        "Open 10 am–5 pm; closed Mondays and government holidays",
        "Ticketed entry; guided tours are 30 minutes and run through the day (as per sheet)"
      ],
      "locals_secret": [
        "Don’t book day tours for Shimla heritage.",
        "Use a taxi smartly: get dropped at Vice Regal Lodge, then walk the heritage zone early."
      ],
      "safety_and_weather": [
        "Monkey’s in Shimla: rhesus macaques can be aggressive — avoid eye contact and keep distance; photos only from afar. Black-faced langurs are generally shy/friendly.",
        "In monsoon (July–September), carry rain protection (torrential spells are common)."
      ],
      "anti_persona": [
        "People unable to walk",
        "Travellers not interested in history, heritage, or architecture"
      ]
    },
    "center": [
      77.165,
      31.1
    ],
    "zoom": 14.0,
    "relatedExperiences": []
  },
  {
    "name": "Shimla Short Heritage Walk",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "A compact, pedestrian-only heritage walk for architecture + views — best timed for sunset.",
    "type": "Short city architecture walk",
    "duration": "1 hr 15 min",
    "effort": "Fair",
    "whyWeChoseThis": "It covers a high-density slice of Shimla’s colonial-era architecture and is wheelchair-friendly (as per the sheet).",
    "goldenWay": "Start this walk around sunset. Stop anywhere between Bantony and Kali Bari for the best skies and pictures. You’ll also find local food vendors near Bantony — benches are limited, so offer seats to elders.",
    "images": [
      "carousel_images/SML002_DJI_20260204164301_0032_D.JPG",
      "carousel_images/SML002_DJI_20260204172433_0154_D.JPG",
      "carousel_images/SML002_XT053632.JPG",
      "carousel_images/SML002_XT053849.JPG",
      "carousel_images/SML002_DJI_20260204172336_0148_D.JPG"
    ],
    "about": [
      "A shorter heritage walk inside Shimla’s official Heritage Zone (pedestrian-only), built around Victorian and post-Victorian architecture and mountain-town street life.",
      "It’s a lighter version of the larger Heritage Architectural Walk — ideal if you want the heritage feel without committing to a long route."
    ],
    "whatYouGet": [
      "Victorian & post-Victorian architecture",
      "Views of the southern hills and northern mountains",
      "Photo opportunities in pedestrian-only streets",
      "Zero vehicle movement throughout the route"
    ],
    "breakdown": {
      "how_it_feels": "Light, visual, and easy to follow — built for strolling, stopping for viewpoints, and noticing architecture.",
      "what_to_expect": [
        "Victorian & post-Victorian architecture",
        "Amazing views of the southern hills and northern mountains",
        "Pedestrian lifestyle of a mountain town",
        "Photo opportunities",
        "Zero vehicle movement"
      ],
      "effort_and_surface": [
        "Short, gentle walk (mostly easy-paced)",
        "Smooth, paved walking throughout",
        "Plan ~45 minutes of walking time, or ~75 minutes if you pause for views and photos"
      ],
      "time_and_access": [
        "Best time: After lunch (sunset works especially well)",
        "Wheelchair accessible; wheelchairs available on rent from Shimla Mall Road (as per sheet)",
        "Pedestrian-only route"
      ],
      "access_and_return": [
        "Easy to club with a Mall Road walk",
        "Use HRTC shared taxis to get dropped at CTO (as per sheet)"
      ],
      "reward_at_end": [
        "Architectural variety (Neo-Gothic to Tudor, Edwardian to Scottish influences)",
        "A strong heritage ‘hit’ in a short duration",
        "Good photos + viewpoints"
      ],
      "safety_and_weather": [
        "Monkey’s in Shimla: rhesus macaques can be aggressive — avoid eye contact and keep distance; photos only from afar. Black-faced langurs are generally shy/friendly.",
        "In monsoon (July–September), carry rain protection (torrential spells are common)."
      ],
      "anti_persona": [
        "People unable to walk",
        "Travellers not interested in history or architecture"
      ]
    },
    "center": [
      77.172,
      31.104
    ],
    "zoom": 15.0,
    "relatedExperiences": []
  },
  {
    "name": "Sunset walk at Forest Hill Road",
    "mood": "calm-nature",
    "color": "#1D4ED8",
    "tagline": "A quiet, low-effort forest-edge walk best timed for golden hour and sunset calm.",
    "type": "Scenic nature walk",
    "duration": "1–1.5 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "It’s one of the easiest ways to get a nature-first, quiet Shimla experience without committing to a hike.",
    "goldenWay": "Plan this with your partner or family — walk and talk, then sit quietly for a few minutes as the sun drops. Keep movement light; the pause is the point.",
    "images": [
      "carousel_images/SML003_DJI_20260204175120_0259_D.JPG",
      "carousel_images/SML003_DJI_20260204175610_0266_D.JPG",
      "carousel_images/SML003_DJI_20260204181356_0283_D.JPG",
      "carousel_images/SML003_XT050553.JPG",
      "carousel_images/SML003_DJI_20260204175158_0261_D.JPG"
    ],
    "about": [
      "A gentle walking experience designed around calm, fresh air, and evening light rather than distance.",
      "This is a ‘slow down’ walk — ideal if you want a softer Shimla moment away from Mall Road noise."
    ],
    "whatYouGet": [
      "A calm forest-edge walk",
      "Golden-hour light and sunset vibe",
      "Low crowd compared to main tourist streets",
      "Best for couples or a small family to walk, sit, and enjoy the quiet"
    ],
    "breakdown": {
      "how_it_feels": "Soft, quiet, and restorative — more about air and stillness than a ‘thing to do’.",
      "what_to_expect": [
        "A calm, nature-led walk",
        "Evening light and a slower pace",
        "Minimal ‘activity’ — the point is to slow down"
      ],
      "effort_and_surface": [
        "Easy-paced walking",
        "Comfortable for most travellers",
        "Outdoor shoes recommended if the path feels damp or uneven"
      ],
      "time_and_commitment": [
        "Best done in the evening (sunset works especially well)",
        "Plan 60–90 minutes if you want to stop and take it in"
      ],
      "access_and_return": [
        "Works well as a standalone evening reset",
        "Easy to pair with an early dinner plan afterward"
      ],
      "anti_persona": [
        "Travellers seeking busy markets, cafés, or high social energy",
        "Those expecting a big ‘checkpoint’ or landmark payoff"
      ],
      "locals_tips": [
        "Go on a day with clear skies for the best light",
        "Keep phones away and walk in silence for a few minutes — it changes the experience"
      ]
    },
    "center": [
      77.16,
      31.107
    ],
    "zoom": 15.0,
    "relatedExperiences": []
  },
  {
    "name": "Hike to Jakhoo Hill (One Side)",
    "mood": "move-a-little",
    "color": "#059669",
    "tagline": "A steep, pedestrian-friendly forest climb past colonial bungalows, ending with views and a quiet pause at Shimla’s highest point.",
    "type": "Uphill forest hike",
    "duration": "2–3 hrs (one side)",
    "effort": "Challenging",
    "whyWeChoseThis": "It’s Shimla’s most iconic effort-led hike — steep enough to feel earned, but structured and pedestrian-friendly enough to be accessible with good pacing.",
    "goldenWay": "Find a corner in the forest and soak in the sun. Can sit at cafe under the tree.",
    "images": [
      "carousel_images/SML004_DJI_20260204173518_0204_D.JPG",
      "carousel_images/SML004_DJI_20260204172755_0169_D.JPG",
      "carousel_images/SML004_DJI_20260204173625_0212_D.JPG",
      "carousel_images/SML004_XT050598.JPG",
      "carousel_images/SML004_XT059728.JPG"
    ],
    "about": [
      "A steep uphill hike to Jakhoo Hill via a paved forest route that passes colonial bungalows and heritage pockets along the way.",
      "The last stretch includes stairs, and the summit feels like a clear ‘reward zone’ — views, calm sitting corners, and mild spiritual atmosphere."
    ],
    "whatYouGet": [
      "Colonial bungalows and heritage pockets (Rothney Castle, Holy Lodge)",
      "A steep climb that genuinely tests fitness",
      "Crisp air and birdsong through forest sections",
      "Pedestrian-friendly walking (low vehicle interaction)",
      "A rewarding summit zone: calm places to sit, views, and the 110 ft Hanuman statue"
    ],
    "breakdown": {
      "how_it_feels": "A steady, steep climb through forest air and heritage pockets, followed by a noticeable shift into calm at the summit.",
      "what_to_expect": [
        "Colonial bungalows",
        "Steep climb to test fitness",
        "Crowd after noon",
        "Rothney Castle, Holy Lodge, forests, Jakhoo hike",
        "Crisp air, birds singing, pedestrian friendly",
        "Langars on Tuesdays"
      ],
      "effort_and_surface": [
        "Steep trail grade",
        "Paved surface with slopes and stairs",
        "Outdoor shoes are recommended"
      ],
      "crowd_and_environment": [
        "Forest sections feel calmer than the top",
        "Crowds tend to build after noon",
        "Crowd spikes on Navratris and Tuesdays"
      ],
      "safety_and_weather": [
        "Monkey’s in Shimla: rhesus macaques and black faced langoors are almost everywhere. Langoors are shy and friendly both but the macaques can be aggressive. If there is a macaque near you, then avoid having eye contact with him. You can click the photo from a distance but not from close proximity.",
        "Himalayan conditions can be dynamic — wear weather-suitable clothing"
      ],
      "access_and_return": [
        "If unable to walk, ropeway can be taken to reach the temple",
        "If you want a car pickup, plan pickup from the temple parking",
        "If you wish to take a taxi/ropeway back to the initial point, you may get one from the parking near Jakhoo"
      ],
      "reward_at_end": [
        "Calm places to sit",
        "110 ft Hanuman statue looking over the city",
        "Good views",
        "Spiritual vibes (mild)"
      ],
      "anti_persona": [
        "Travellers with knee or mobility issues",
        "Anyone uncomfortable with steep, sustained climbs",
        "Those looking for a calm or leisure-only walk"
      ]
    },
    "center": [
      77.175,
      31.11
    ],
    "zoom": 15.0,
    "relatedExperiences": []
  },
  {
    "name": "Taradevi Day Hike",
    "mood": "move-a-little",
    "color": "#059669",
    "tagline": "A quiet jungle trail leading to a hilltop temple, best done as a slow half-day escape from Shimla.",
    "type": "Jungle trail hike",
    "duration": "Half day (including travel)",
    "effort": "Moderate",
    "whyWeChoseThis": "It offers a rare combination of forest immersion, quiet, and elevation, making it ideal for travellers seeking a meaningful outdoor pause without a strenuous trek.",
    "goldenWay": "Plan this as a half-day outing. Walk slowly through the forest, reach the temple area before sunset, and avoid stacking another activity immediately after.",
    "images": [
      "carousel_images/SML005_XT054359.JPG",
      "carousel_images/SML005_XT059844.JPG",
      "carousel_images/SML005_XT059876.JPG",
      "carousel_images/SML005_XT059891.JPG",
      "carousel_images/SML005_XT059831.JPG"
    ],
    "about": [
      "A nature-first jungle trail hike near Shimla that leads to the Tara Devi temple area.",
      "The experience is defined by forest walking, silence, and open hill views rather than distance or speed."
    ],
    "whatYouGet": [
      "A true jungle trail experience",
      "Quiet forest walking with minimal crowd",
      "Open views of the lower hills near the temple",
      "A calm outdoor break away from the city"
    ],
    "breakdown": {
      "how_it_feels": "Quiet, grounded, and nature-led. The trail rewards comfort with silence more than physical fitness.",
      "effort_and_surface": [
        "Jungle and forest trail surface",
        "Can be slippery depending on weather",
        "Outdoor or hiking shoes are required"
      ],
      "water_and_food": [
        "No water available along the trail",
        "Water available only at the entry and exit points",
        "A café is available near the temple for food and refreshments"
      ],
      "time_and_commitment": [
        "Best done in the afternoon leading into early evening",
        "Works well as a sunset experience",
        "Should be completed before sunset",
        "Overall commitment is roughly half a day including travel"
      ],
      "access_and_return": [
        "This is an A to B trail, not a loop",
        "If self-driving, you’ll need to either retrace your steps or arrange a taxi pickup from the temple area",
        "A taxi-assisted plan is more relaxed than managing a single parked car"
      ],
      "crowd_and_environment": [
        "Very quiet along the trail",
        "Crowds increase only near the temple area"
      ],
      "anti_persona": [
        "Travellers uncomfortable with silence or forest settings",
        "People expecting a casual, café-led outing",
        "Those looking for a short or spontaneous add-on",
        "Anyone planning to play loud music on the trail"
      ],
      "locals_tips": [
        "Carry enough water from the start",
        "Start early enough to finish comfortably before sunset",
        "Pause near the temple area for views before heading back"
      ]
    },
    "center": [
      77.135,
      31.085
    ],
    "zoom": 13.0,
    "relatedExperiences": []
  },
  {
    "name": "Malling at The Mall Road",
    "mood": "cafes-conversations",
    "color": "#EA580C",
    "tagline": "Immerse yourself in vehicle free heart of the town, blending colonial charm with modern…",
    "type": "Evening walks, shoping, food, socialisi…",
    "duration": "3 hour",
    "effort": "Easy",
    "whyWeChoseThis": "Heart of Shimla",
    "goldenWay": "Try different food at different locations. Order as suggested by locals from recommended shops.",
    "images": [
      "carousel_images/SML006_XT054007.JPG",
      "carousel_images/SML006_XT053982.JPG",
      "carousel_images/SML006_XT054102.JPG",
      "carousel_images/SML006_XT059708.JPG",
      "carousel_images/SML006_XT053666.JPG"
    ],
    "about": [
      "Immerse yourself in vehicle free heart of the town, blending colonial charm with modern leisure.",
      "This is cities active social hub where people come for socialising and is pedestrian paradise for locals."
    ],
    "whatYouGet": [
      "Best way to socialise or walk market streets",
      "Enjoy great food",
      "Art gallaries, Theatrics, LIve shows,"
    ],
    "breakdown": {
      "how_it_feels": "-Colonial architecture -Shops both branded/non branded -Cafe, Restaurants, Street Food, Skybars -Cultural programs in open amphiteatre & indoor theatres",
      "locals_tip": "Avoid Lift to Mall road. Take a small road descending down very next to apple store. It's just a few meters from Parking near Lift. Do not feed/ tease monkeys. The core mall road…",
      "safety_notes": "Do not feed/ tease monkeys. The core mall road is no smoking zone. Spitting and smoking is penalised. Beware of common scams, specifically regarding \"Pashmina\" shawls, aggressive hawkers, and \"Chingu…",
      "weather_notes": "Himalayan conditions can be dynamic, wear weather suitable clothing. Light shoes are recommended. Connected to parkign with lift, people unable to walk can take lift to mall road which opens near Com…",
      "misc": "Crowded at peak hours",
      "media_links": "https://drive.google.com/drive/folders/1GsQ8ISr1YT60_nKjBbE1ndsvZbTGKcO0?usp=sharing",
      "who_its_not_for": [
        "Peace seekers who wish to avoid commercial place.",
        "Can't ressist smoking in public."
      ],
      "effort_and_surface": [
        "Paved - Smooth",
        "Dry&Firm",
        "Pedestrian only. Accessible to wheel chairs.",
        "Tickets: Tickets only at Gaiety Theatre for cetrain events."
      ]
    },
    "center": [
      77.172,
      31.104
    ],
    "zoom": 16.0,
    "relatedExperiences": []
  },
  {
    "name": "Larger Shimla eMTB Loop",
    "mood": "move-a-little",
    "color": "#059669",
    "tagline": "A larger early-morning e-bike loop that connects Shimla’s seven hills — quiet lanes, first light, and a full-town glimpse.",
    "type": "Early morning e-bike loop",
    "duration": "2–3 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "Best route to cycle in the morning and get a glimpse of the whole town.",
    "goldenWay": "",
    "images": [
      "carousel_images/SML007_XT059623.JPG",
      "carousel_images/SML007_XT059632.JPG",
      "carousel_images/SML007_XT059627.JPG",
      "carousel_images/SML007_XT059754.JPG",
      "carousel_images/SML007_XT059749.JPG"
    ],
    "about": [
      "A larger cycling loop through core Shimla that connects all seven hills of the city.",
      "Built for early mornings — fewer people, calmer roads, and a rare chance to see the town wake up."
    ],
    "whatYouGet": [
      "A wide-angle Shimla experience (not just one neighbourhood)",
      "Quiet lanes and strong photo moments in morning light",
      "A satisfying ‘I saw the whole town’ feeling",
      "A clean, energising start to the day"
    ],
    "breakdown": {
      "how_it_feels": "Active but not intense — more about flowing through the town in first light than chasing speed or a checklist.",
      "effort_and_surface": [
        "Easy effort overall (e-bike friendly)",
        "Mostly paved roads; comfort depends on traffic and weather",
        "This is a longer loop — you’ll enjoy it most if you’re okay being out for a couple of hours"
      ],
      "time_and_commitment": [
        "Best time: Early morning",
        "Plan ~2 hours if you ride steadily, or ~3 hours if you stop for chai points, photos, and short breaks"
      ],
      "diy_and_logistics": [
        "Download route GPX file here for navigation via Garmin / Apple Watch: {GPX_LINK}",
        "This is a loop route (you return to the start), so planning is simpler than point-to-point rides",
        "If you want pickup/backup support, speak to your hotel or bike provider in advance"
      ],
      "locals_secret": [
        "If your hotel doesn’t provide cycles, try local vendors for good-quality e-bikes/cycles and helmets."
      ],
      "weather_and_shoes": [
        "Himalayan conditions can be dynamic — wear weather-suitable clothing.",
        "Light shoes are recommended."
      ],
      "anti_persona": [
        "Travellers who dislike early mornings",
        "Anyone not comfortable being outdoors for 2–3 hours"
      ]
    },
    "center": [
      77.17,
      31.1
    ],
    "zoom": 13.0,
    "relatedExperiences": []
  },
  {
    "name": "Short Toy Train Ride",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "A short ride on the UNESCO-heritage toy train route — scenic, slow, and unexpectedly charming.",
    "type": "Toy train ride",
    "duration": "1–1.5 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "It lets you experience the toy train’s heritage charm in a short, low-effort format.",
    "goldenWay": "Try the evening train — it’s usually less crowded. If possible, book one that leaves at sunset (or a few minutes before). Take a right-side window for the best light and photos.",
    "images": [
      "carousel_images/SML008_IMG_0831.JPG",
      "carousel_images/SML008_IMG_0980.JPG",
      "carousel_images/SML008_IMG_0992.JPG",
      "carousel_images/SML008_IMG_1006.JPG",
      "carousel_images/SML008_IMG_0974.JPG"
    ],
    "about": [
      "A short ride on the UNESCO world-heritage toy train route — ideal if you want the charm without committing to a long journey.",
      "This is a slow, vintage experience built around views, open-window photography, and the feel of an older way of travel."
    ],
    "whatYouGet": [
      "A scenic, easy-going train section",
      "Classic heritage charm and vintage vibe",
      "Open-window photography",
      "A quick micro-experience without a long time commitment",
      "Sunset ride potential if you take an evening train"
    ],
    "breakdown": {
      "how_it_feels": "Slow, scenic, and nostalgic — this is about the ride, the views, and the vintage rhythm.",
      "effort_and_surface": [
        "Easy, seated experience",
        "Plan ~70 minutes if you want a relaxed ride without rushing"
      ],
      "tickets_and_timings": [
        "Ticketed ride — book in advance if you can",
        "Trains from Shimla: 10:55 am, 2:15 pm, 4:25 pm",
        "Return trains: 5:40 pm, 6:30 pm",
        "Vistadome is worth booking if available; general ticket works fine for a short ride"
      ],
      "diy_and_logistics": [
        "Recommended short section: Shimla → Tara Devi junction",
        "Try to club this with the Tara Devi hike for a fuller half-day plan"
      ],
      "crowd_notes": [
        "Crowds vary by season — evening trains are generally less crowded"
      ],
      "weather_and_shoes": [
        "Himalayan conditions can be dynamic — wear weather-suitable clothing.",
        "Light shoes are recommended."
      ],
      "anti_persona": [
        "Travellers who do not enjoy a slow, vintage vibe"
      ]
    },
    "center": [
      77.1,
      31.05
    ],
    "zoom": 12.0,
    "relatedExperiences": []
  },
  {
    "name": "Shimla Kalka Vistadome Train",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "A luxurious, glass-roof Vistadome ride on the UNESCO heritage toy-train route — valleys, forests, tunnels, and slow-travel charm.",
    "type": "Vistadome heritage train ride",
    "duration": "5–6 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "It’s the most comfortable way to experience the full heritage rail journey — scenic, nostalgic, and genuinely different from road travel.",
    "goldenWay": "",
    "images": [],
    "about": [
      "The Kalka–Shimla Vistadome is a comfortable 5–6 hour journey through the Himalayan foothills with large windows, a panoramic glass ceiling, and rotating seats.",
      "It’s a scenic, heritage-first way to experience the narrow-gauge route — more ‘slow travel’ than point-to-point transport."
    ],
    "whatYouGet": [
      "UNESCO world-heritage narrow-gauge mountain rail journey",
      "Valleys, forests, tunnels, and dramatic hillside views",
      "A more comfortable, premium on-board experience (Vistadome coach)",
      "Small stops that add to the old-world rhythm of the ride"
    ],
    "breakdown": {
      "how_it_feels": "Cinematic and unhurried — you’re here for views, tunnels, and old-world rhythm, not speed.",
      "what_to_expect": [
        "Engineering & heritage highlights",
        "A premium on-board experience",
        "A long scenic journey with tunnels and valley views",
        "Small pit-stops along the way"
      ],
      "effort_and_surface": [
        "Seated, easy experience for most travellers",
        "Long duration — best enjoyed if you’re comfortable being on the move for ~5–6 hours"
      ],
      "tickets_and_timings": [
        "Ticketed train ride",
        "Check the current train schedule while booking (timings can vary)"
      ],
      "diy_and_logistics": [
        "For the best valley views when going uphill (Kalka → Shimla), choose the right-hand side seats",
        "For the return downhill journey (Shimla → Kalka), the left-hand side seats are better",
        "For a more ‘cinematic’ ride, the earliest morning train is usually the most rewarding (cooler air + softer light)"
      ],
      "reward_at_end": [
        "A luxurious heritage experience on narrow-gauge rails"
      ]
    },
    "center": [
      77.045,
      30.973
    ],
    "zoom": 10.0,
    "relatedExperiences": []
  },
  {
    "name": "The Calm Circuit",
    "mood": "with-a-local",
    "color": "#7C2D12",
    "tagline": "A signature slow-travel loop — e-biking + forest bathing inside a reserved forest, built for deep calm.",
    "type": "Guided e-bike + forest bathing",
    "duration": "2–2.5 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "It’s a true reset: easy e-biking inside a majestic Deodar forest, paired with an intentional slow-down (forest bathing).",
    "goldenWay": "Keep the ride unhurried — let the forest set the pace. Ride in silence for a few minutes, then stop under the densest Deodar stretch for a slow forest-bathing pause before continuing. It’s an ideal way to spend quality outdoor time with family, especially with adolescent kids.",
    "images": [
      "carousel_images/SML011_7778777.jpg",
      "carousel_images/SML011_refuje-109.jpg",
      "carousel_images/SML011_refuje-115.jpg",
      "carousel_images/SML011_refuje-113.jpg",
      "carousel_images/SML011_77878.jpg"
    ],
    "about": [
      "A signature slow-travel experience curated by Refuje near Shimla, designed for sustainable and mindful exploration.",
      "You ride pedal-assisted e-bikes on a wide, well-maintained track through one of the world’s largest Deodar forests, then slow down with a forest-bathing session.",
      "The route is designed to be comfortable for almost everyone — including beginners, kids 12+ years, and anyone who hasn’t ridden a cycle in years."
    ],
    "whatYouGet": [
      "Mental rejuvenation",
      "Solace and connection to nature",
      "Joy of cycling on comfortable pedal-assisted e-bikes",
      "A majestic reserved jungle: dense, tall Deodars and rich flora-fauna",
      "A historic British-era reservoir inside the forest"
    ],
    "breakdown": {
      "how_it_feels": "Deep calm and nature immersion — less ‘workout’, more ‘reset’ with quiet riding and a guided slow-down in the forest.",
      "effort_and_surface": [
        "Easy effort (pedal-assisted e-bikes)",
        "Wide, well-maintained cycling path (comfortable for most travellers)"
      ],
      "time_and_commitment": [
        "Best time: After lunch",
        "Plan ~2.5 hours end-to-end (briefing + ride + forest-bathing session)"
      ],
      "logistics_and_support": [
        "Full-time professional guide throughout",
        "Best-in-class gear provided (e-bike + helmet)",
        "Entry permits and required paperwork are handled by Refuje",
        "Start point: Shimla Water Catchment Wildlife Sanctuary Gate",
        "Operational hours: 10:00 am – 4:00 pm",
        "Closed on Mondays"
      ]
    },
    "center": [
      77.12,
      31.08
    ],
    "zoom": 13.0,
    "relatedExperiences": []
  },
  {
    "name": "Ride into Stillness",
    "mood": "with-a-local",
    "color": "#7C2D12",
    "tagline": "A long, quiet e-bike ride into Shimla’s countryside — pine forests, village life, and low-traffic roads away from the city buzz.",
    "type": "Countryside e-bike ride",
    "duration": "3–4 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML012_refuje-108.jpg",
      "carousel_images/SML012_refuje-110.jpg",
      "carousel_images/SML012_XT052312.jpg",
      "carousel_images/SML012_XT052511.jpg",
      "carousel_images/SML012_XT052548.jpg"
    ],
    "about": [
      "A 45 km cycling route through Shimla’s tranquil countryside — a complete contrast to city life.",
      "You ride past small dwellings and rivulets, with pine forests and quieter landscapes that most travellers don’t see. It works especially well in late-afternoon light."
    ],
    "whatYouGet": [
      "Low-traffic countryside roads (ideal for relaxed cycling)",
      "Premium pedal-assisted e-bikes",
      "A gentle, mostly paved ride with easy loops",
      "Small dwellings and rivulets on the way",
      "Slow travel and village life",
      "Mental rejuvenation and a deeper connection to nature"
    ],
    "breakdown": {
      "how_it_feels": "A long, grounding ride — built more for stillness and scenery than speed. Quiet countryside, low traffic, and a wide-open contrast to Shimla town.",
      "effort_and_surface": [
        "Gentle effort overall",
        "Mostly smooth, paved surface",
        "Typically dry and firm conditions"
      ],
      "time_and_commitment": [
        "Best time: After lunch",
        "Plan ~3 hours of riding time, and ~4 hours overall if you include briefing and breaks",
        "Operational window: 9:00 am to 5:00 pm"
      ],
      "logistics_and_support": [
        "Full-time professional guide throughout",
        "Best-in-class gear provided (e-bike + helmet)",
        "Permits and required paperwork are handled by Refuje"
      ],
      "safety_and_gear": [
        "Avoid sandals/open footwear — outdoor shoes are recommended",
        "Do not feed monkeys or engage with wildlife"
      ],
      "weather": [
        "Himalayan conditions can be dynamic — wear weather-suitable clothing."
      ]
    },
    "center": [
      77.1,
      31.05
    ],
    "zoom": 12.0,
    "relatedExperiences": []
  },
  {
    "name": "Glen Hiking Trail-1",
    "mood": "calm-nature",
    "color": "#1D4ED8",
    "tagline": "A serene forested trail linking Glen Valley to the Gurkha Gate side of Vice Regal Lodge — quiet, green, and restorative.",
    "type": "Forested valley hike",
    "duration": "1–1.5 hrs",
    "effort": "Fair",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML013_XT050065.JPG",
      "carousel_images/SML013_XT050074.JPG",
      "carousel_images/SML013_XT050092.JPG",
      "carousel_images/SML013_XT050094.JPG",
      "carousel_images/SML013_XT050070.JPG"
    ],
    "about": [
      "A serene, forested hiking route that connects the low-lying Glen Valley to the historic Gurkha Gate of Vice Regal Lodge.",
      "This is the primary trail leading from the Glen — the historic British-era Brass Path — and it passes near the Iverarm tunnel of the UNESCO heritage rail route."
    ],
    "whatYouGet": [
      "Mental rejuvenation",
      "Solace and connection to nature",
      "Joy of hiking",
      "A rare heritage detail hidden inside a forest walk (Brass Path + nearby heritage rail tunnel)"
    ],
    "breakdown": {
      "how_it_feels": "Quiet and forest-led — a short hike built around greenery, stillness, and a reset feeling.",
      "effort_and_surface": [
        "Distance: 2.5 km",
        "Minimum walking time: ~1 hr",
        "Best enjoyed: ~1 hr 20 min with pauses",
        "Surface: hard earth (typically dry and firm)",
        "Pedestrian-only route"
      ],
      "time_and_commitment": [
        "Best time: After noon"
      ],
      "weather_and_shoes": [
        "Himalayan conditions can be dynamic — wear weather-suitable clothing.",
        "Outdoor shoes are recommended."
      ],
      "safety": [
        "Rhesus macaques can be aggressive — avoid eye contact and keep distance. Click photos only from afar. Black-faced langurs are generally shy/friendly."
      ]
    },
    "center": [
      77.155,
      31.095
    ],
    "zoom": 14.0,
    "relatedExperiences": []
  },
  {
    "name": "Lower Bazar- Food & Photowalk",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "Shimla’s most ‘real’ street-life pocket — vegetable + masala markets, tight alleys, bold contrasts, and great portraits.",
    "type": "Street photo + local market walk",
    "duration": "1–1.5 hrs",
    "effort": "Fair",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML015_XT053837.JPG",
      "carousel_images/SML015_XT054187.JPG",
      "carousel_images/SML015_XT054051.JPG",
      "carousel_images/SML015_XT053810.JPG",
      "carousel_images/SML015_XT050590.JPG"
    ],
    "about": [
      "Lower Bazaar is Shimla’s go-to spot for local shopping and everyday street life — vegetable market, Ganj Bazaar, masala market, and traditional shops.",
      "If you enjoy street portraiture and street photography, this is one of the best areas in town — especially if you follow the natural light through the lanes."
    ],
    "whatYouGet": [
      "A strong contrast to Mall Road (raw, local, and busy)",
      "Vegetable and masala markets, plus traditional shops",
      "Traditional street food options",
      "Excellent street photography and portrait opportunities"
    ],
    "breakdown": {
      "how_it_feels": "Vibrant and chaotic in a good way — bustling crowds, tight lanes, and high sensory energy. A very different Shimla than the Mall Road vibe.",
      "what_to_expect": [
        "Vibrant chaos of local life",
        "Bustling crowds",
        "Intense contrast to Mall Road",
        "Traditional street food and a Sunday flea market",
        "Vegetable & masala markets across Lower Bazaar"
      ],
      "effort_and_surface": [
        "Mostly flat walking",
        "Paved, smooth surface",
        "Plan ~45 minutes of walking, or ~90 minutes if you stop for photos and food"
      ],
      "time_and_crowd": [
        "Best time: Late afternoons",
        "Crowded during evening office hours"
      ],
      "reward_at_end": [
        "Great for street photography",
        "Food options",
        "Traditional shops"
      ],
      "safety_and_comfort": [
        "The market alleys can feel overwhelming if you’re not used to tight, crowded spaces with limited room to move."
      ],
      "weather": [
        "During monsoon months (July–September), torrential rain is possible — carry rain protection."
      ]
    },
    "center": [
      77.168,
      31.103
    ],
    "zoom": 16.0,
    "relatedExperiences": []
  },
  {
    "name": "Victorian Twilight",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "An evening at the Gaiety Theatre — restored Victorian halls, a regal hush, and live performances.",
    "type": "Evening theatre + heritage",
    "duration": "1 hr",
    "effort": "Easy",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML016_XT053849.JPG",
      "carousel_images/SML016_XT053924.JPG",
      "carousel_images/SML016_XT053845.JPG"
    ],
    "about": [
      "For the ultimate experience, visit the Gaiety Theatre in the evening, when the colonial-style auditoriums feel regal and hushed.",
      "A historic cultural hub in Shimla — walk through restored Victorian halls and, if available, stay back for live classical music or contemporary theatre."
    ],
    "whatYouGet": [
      "A restored Victorian-era cultural landmark",
      "Old-world ambience in the evening",
      "Live classical music or theatre performances (subject to schedule)",
      "A strong ‘Queen of the Hills’ aesthetic moment"
    ],
    "breakdown": {
      "how_it_feels": "Regal, quiet, and cultural — less a ‘walk’, more an evening mood experience built around heritage interiors and performances.",
      "effort_and_surface": [
        "Easy effort",
        "Smooth, paved approach",
        "Comfortable for most travellers"
      ],
      "time_and_commitment": [
        "Best time: Evenings after 3 pm",
        "Plan ~1 hour"
      ],
      "tickets_and_timings": [
        "Operational hours: 10:00 am to 5:00 pm",
        "Accessible to all; some events may be ticketed"
      ]
    },
    "center": [
      77.172,
      31.104
    ],
    "zoom": 17.0,
    "relatedExperiences": []
  },
  {
    "name": "Bantony",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "Tudor-style charm + a surprisingly modern digital museum — and a great sunset spot in the open grounds.",
    "type": "Heritage building + museum",
    "duration": "1 hr",
    "effort": "Easy",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML017_XT053632.JPG",
      "carousel_images/SML017_XT053634.JPG",
      "carousel_images/SML017_XT053623.JPG",
      "carousel_images/SML017_XT053626.JPG",
      "carousel_images/SML017_XT053624.JPG"
    ],
    "about": [
      "Bantony Castle is a classic Tudor (chalet-style) landmark — wooden frames, sloped roofs, and old-world charm.",
      "Inside, it has a modern digital museum that walks you through Shimla’s story — the British Raj, the freedom movement, and the present — using touchscreens, 3D models, and audio guides.",
      "Don’t miss the open spaces around the building — it’s a lovely place to catch sunset."
    ],
    "whatYouGet": [
      "Tudor-style heritage architecture",
      "A modern, engaging digital museum experience",
      "Insightful exhibits on Shimla’s history",
      "Open grounds with a strong sunset moment"
    ],
    "breakdown": {
      "how_it_feels": "A calm, open heritage stop with a well-done museum — easy, informative, and best paired with sunset.",
      "what_to_expect": [
        "Historical architecture combined with modern presentation",
        "Calm, open crowd",
        "Insightful and engaging exhibits",
        "Visually stunning sunsets"
      ],
      "effort_and_surface": [
        "Easy, flat access",
        "Paved, smooth surfaces"
      ],
      "tickets_and_timings": [
        "Ticketed entry",
        "Open 10:00 am to 5:00 pm",
        "Closed on Mondays and public holidays"
      ],
      "crowd_notes": [
        "Can feel crowded during peak hours and around light-show timings"
      ],
      "weather_and_shoes": [
        "Himalayan conditions can be dynamic — wear weather-suitable clothing.",
        "Outdoor shoes are recommended."
      ],
      "safety": [
        "Rhesus macaques can be aggressive — avoid eye contact and keep distance. Click photos only from afar. Black-faced langurs are generally shy/friendly."
      ]
    },
    "center": [
      77.167,
      31.106
    ],
    "zoom": 17.0,
    "relatedExperiences": []
  },
  {
    "name": "Cactarium & Heritage Museum",
    "mood": "wander-discover",
    "color": "#7C3AED",
    "tagline": "Army Heritage Museum + Cactarium at Annandale — add a short walk around the golf course and nearby trails, and finish at the army-run café.",
    "type": "Museum + easy walk",
    "duration": "1–2 hrs",
    "effort": "Easy",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML018_XT059967.JPG",
      "carousel_images/SML018_XT059996.JPG",
      "carousel_images/SML018_XT059982.JPG",
      "carousel_images/SML018_XT059963.JPG",
      "carousel_images/SML018_XT059997.JPG"
    ],
    "about": [
      "Visit the Army Heritage Museum and the Cactarium at Annandale (Anandale) Golf Course.",
      "Pair it with a short walk around the golf course and nearby trails, and optionally try the AK47 simulator experience."
    ],
    "whatYouGet": [
      "Annandale Golf Course atmosphere",
      "Army Heritage Museum + Cactarium",
      "Easy trails to walk",
      "An army-run café for a simple meal/tea",
      "Optional shooting (AK47) simulator experience"
    ],
    "breakdown": {
      "how_it_feels": "Easy, curated, and a little unexpected — museum + cactus collection, with a calm open area to stroll and pause.",
      "effort_and_surface": [
        "Easy walking",
        "Paved, smooth surface in most parts",
        "Plan ~1 hour minimum; longer if you stroll more or add the simulator"
      ],
      "time_and_commitment": [
        "Best time: Before 1 pm"
      ],
      "tickets_and_timings": [
        "Ticket: INR 200",
        "Apr–Sep: 10:00 am–5:00 pm (break 1:00–2:00 pm)",
        "Oct–Mar: 10:00 am–4:00 pm (break 1:00–2:00 pm)"
      ],
      "what_to_expect": [
        "Annandale Golf Course",
        "Army Heritage Museum & Cactarium",
        "Trails to walk"
      ],
      "accessibility": [
        "Accessible to all",
        "Connected to parking with a lift — useful for visitors who prefer minimal walking"
      ],
      "crowd_notes": [
        "Crowded at peak hours"
      ],
      "weather_and_shoes": [
        "Himalayan conditions can be dynamic — wear weather-suitable clothing.",
        "Light shoes are recommended."
      ],
      "safety": [
        "Rhesus macaques can be aggressive — avoid eye contact and keep distance. Click photos only from afar. Black-faced langurs are generally shy/friendly."
      ]
    },
    "center": [
      77.163,
      31.092
    ],
    "zoom": 15.0,
    "relatedExperiences": []
  },
  {
    "name": "Morning in Forest Hill Road",
    "mood": "calm-nature",
    "color": "#1D4ED8",
    "tagline": "A quiet morning loop on Forest Hill Road + Lovers Lane — crisp air, birdsong, and Shimla waking up.",
    "type": "Morning walk / run / cycle loop",
    "duration": "1.5 hrs",
    "effort": "Fair",
    "whyWeChoseThis": "",
    "goldenWay": "",
    "images": [
      "carousel_images/SML019_DJI_20260204175523_0264_D.JPG",
      "carousel_images/SML019_DJI_20260204181030_0277_D.JPG",
      "carousel_images/SML019_DJI_20260204181034_0278_D.JPG",
      "carousel_images/SML019_DJI_20260204174717_0243_D.JPG",
      "carousel_images/SML019_DJI_20260204174701_0241_D.JPG"
    ],
    "about": [
      "A morning loop on the east of Shimla town combining Forest Hill Road and Lovers Lane — ideal for cyclists, walkers, and runners.",
      "It runs through a forested stretch with colonial bungalows and a lane network that lets you choose your intensity."
    ],
    "whatYouGet": [
      "A lane network rich in history, with well-preserved forested roads",
      "Clean, quiet morning lanes before the town gets busy",
      "Crisp air, birds singing, and the feeling of life waking up in the hills",
      "Sitting points to catch sunrise and write/journal",
      "Choice of roads and lane variants to fit your workout"
    ],
    "breakdown": {
      "how_it_feels": "A calm, fresh-start loop — soft light, forest air, and a ‘mountain town’ feel before the day crowds arrive.",
      "effort_and_surface": [
        "Distance: 8 km",
        "Mostly level (steeper if you use stair shortcuts)",
        "Surface: paved (typically dry & firm)",
        "Most parts of the route are pedestrian-only"
      ],
      "time_and_commitment": [
        "Best time: Before 8:30 am",
        "Minimum enjoyment time: ~1.5 hours"
      ],
      "how_to_use_this_loop": [
        "Keep it easy and stay on the main lanes for a gentle morning stroll",
        "Add lane variants or stair shortcuts if you want a stronger workout",
        "Use the sitting points for sunrise, quiet pauses, or journaling"
      ],
      "diy_and_logistics": [
        "If your hotel does not provide cycles, try local vendors for good-quality e-bikes/cycles and helmets."
      ],
      "who_its_not_for": [
        "People who are slow and inactive in the morning"
      ],
      "safety": [
        "Rhesus macaques can be aggressive — avoid eye contact and keep distance. Click photos only from afar. Black-faced langurs are generally shy/friendly."
      ],
      "weather": [
        "During monsoon months (July–September), torrential rain is possible — carry rain protection.",
        "Himalayan conditions can be dynamic — wear weather-suitable clothing."
      ]
    },
    "center": [
      77.165,
      31.105
    ],
    "zoom": 14.0,
    "relatedExperiences": []
  }
]